#include <stdio.h>

int main()
{
	printf("\tS H I N S E G A E\n");
	printf("%s %s", "(주)신세계 경기점\t","T:1588-1234\n");
	printf("경기 용인 수지구 포은대로 536\n");
	printf("%s %s","201-81-35195\t","차 청 호\n");
	printf("구매 2022-01-13 11:25 거래번호:4421-7964\n");
	printf("%13s %13s %13s","상품명","수량","금액\n");
	printf("%13s %7d %13ld\n\n","플랙진 캐쥬얼 상의",1,139000);
	printf("%-20s %19ld\n","합            계",139000);
	printf("%-20s %19ld\n","과 세 물 품 가액",126364);
	printf("%-20s %19ld\n\n","부     가     세",12636);
	printf("----------------------------------------\n");
	printf("%-19s %20ld\n","카 드 결 제 액",139000);
	printf("%-19s %20s\n","비  씨(체크)","538903******8320");
	printf("%-14s %17s %8s","승인번호","42241644","일시불\n");
	printf("----------------------------------------\n");
	printf("강*웅 고객님의 포인트 현황입니다.\n");
	printf("%-16s %-6c %s","신세계포인트카드",'M',"935013******3087\n");
	printf("%-20s %20s","금회적립포인트  :","139\n");
	printf("%-20s %20s","누적(가용)포인트:","585(446)\n");
	printf("신세계포인트 유효기간은 2년 입니다.\n");
		
	return 0;
}
